export const participantRules = `قوانين البطولات للمشاركين
تسجيلك في البطولة يعني أنك قرأت قوانين البطولة، ووافقت عليها، وأكدت قدرتك على حضور جميع المباريات.

الغش
يُمنع الغش بجميع أنواعه.
في حال ثبوت الغش، يتم حظر اللاعب من السيرفر.

التكسكة
تُمنع التكسكة بجميع انواعها أثناء البطولات، حتى لو كانت بين أصدقاء.
عقوبة ذلك هي الحظر من المشاركة في البطولات.

الالتزام بالحضور
تسجيلك في البطولة يعني تأكيد قدرتك على حضور جميع المباريات.
في حال غيابك، يتم تطبيق لائحة إنذارات الغياب الخاصة بالبطولات.

إنذارات الغياب عن البطولات
تُطبّق العقوبات التالية عند غياب اللاعب عن مباريات البطولة:
الإنذار الأول: يتم تنبيه اللاعب.
الإنذار الثاني: يُمنع اللاعب من المشاركة في البطولة القادمة.
الإنذار الثالث: يُحرم اللاعب من المشاركة في جميع بطولات السيرفر.

الفرق واللاعبون الاحتياطيون
بعد إنشاء الفرق، يجب تحديد اللاعبين الأساسيين والاحتياطيين لكل فريق.
إذا لم يتمكن الفريق من لعب المباراة بسبب غياب لاعبيه، يتم:
إقصاء الفريق من البطولة.
توجيه إنذار إلى اللاعب أو اللاعبين المتغيبين.

استغلال أخطاء اللعبة
يُمنع استغلال أي خلل أو ثغرة في اللعبة تؤثر على نتيجة المباراة.
في حال ثبوت ذلك، يُحظر اللاعب نهائيًا من المشاركة في بطولات السيرفر.

إيقاف المباراة
يُمنع استخدام خاصية الـPause دون وجود سبب واضح ومقبول.`;
